In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
print("Personal Information")
abdul = pd.read_csv("abdulbaqqi_personal_information.csv")
aishat = pd.read_csv("Aishat_Personal_Information.csv")
bisola = pd.read_csv("Bisola_personal_information.csv")
feranmi = pd.read_csv("Oluwaferanmi_PersonalInfo.csv")
samuel = pd.read_csv("Samuel_Personal_Information.csv")
state = pd.read_csv("Statesman_personal_information.csv")
theo = pd.read_csv("TheophilusPersonal Information.csv")

Personal Information

In [3]:
abdul = pd.DataFrame(abdul)
abdul

,Unnamed: 0,EMAIL,FIRST NAME,LAST NAME,LOCATION,TELEPHONE
0,1,salawuabdulbaki@gmail.com,abdulbaki,salawu,olawale yahaya bagaruwa street ilorin,9068924442

In [4]:
abdul1 = abdul.rename({"EMAIL":"Email", "FIRST NAME":"First_name", "LAST NAME":"Last_name", "LOCATION":"Location", "TELEPHONE":"Phone_number",}, axis='columns')
del abdul1['Unnamed: 0']
abdul1

,Email,First_name,Last_name,Location,Phone_number
0,salawuabdulbaki@gmail.com,abdulbaki,salawu,olawale yahaya bagaruwa street ilorin,9068924442

In [5]:
aishat = pd.DataFrame(aishat)
aishat

,Unnamed: 0,First name,Middle name,Surname,Address,Email,Tel
0,0,Aishat,Ayinke,Aremu,33 Issah Williams Street Apongnon,aishatmorenike1@gmail.com,7084283672

In [6]:
aishat2 = aishat.rename({"First name":"First_name", "Surname":"Last_name", "Address":"Location", "Tel":"Phone_number"}, axis='columns')
del aishat2['Unnamed: 0']
del aishat2["Middle name"]
aishat2

,First_name,Last_name,Location,Email,Phone_number
0,Aishat,Aremu,33 Issah Williams Street Apongnon,aishatmorenike1@gmail.com,7084283672

In [7]:
bisola = pd.DataFrame(bisola)
bisola

,Unnamed: 0,Last Name,First Name,Phone Number,Location,E-mail
0,0,Bolomope,Faoziyyah,9059329620,Oyo,bisolabolomope@gmail.com

In [8]:
bisola3 = bisola.rename({"Last Name":"Last_name", "First Name":"First_name", "Phone Number":"Phone_number", "E-mail":"Email"}, axis='columns')
del bisola3["Unnamed: 0"]
bisola3

   Last_name First_name  Phone_number Location                     Email
0  Bolomope   Faoziyyah    9059329620      Oyo  bisolabolomope@gmail.com

In [9]:
feranmi = pd.DataFrame(feranmi)
feranmi

     Last Name First Name         Tel Location                 Email
0  Ajirireloja    Michael  9076588590    Abuja  aechealgr8@gmail.com

In [10]:
feranmi4 = feranmi.rename({"Last Name":"Last_name", "First Name":"First_name", "Tel":"Phone_number",}, axis='columns')
feranmi4

     Last_name First_name  Phone_number Location                 Email
0  Ajirireloja    Michael    9076588590    Abuja  aechealgr8@gmail.com

In [11]:
samuel = pd.DataFrame(samuel)
samuel

,Unnamed: 0,Last_name,First_name,Phone_number,Location,E-mail
0,0,AKINLABI,Samuel,7012659092,Lagos,samueloreoluwa4@gmail.com

In [12]:
samuel5 = samuel.rename({"E-mail":"Email"}, axis='columns')
del samuel5['Unnamed: 0']
samuel5

   Last_name First_name  Phone_number Location                      Email
0  AKINLABI     Samuel     7012659092    Lagos  samueloreoluwa4@gmail.com

In [13]:
state = pd.DataFrame(state)
state

,Unnamed: 0,Last name,First name,Phone number,Location,Email
0,0,Statesman,Oyehan Adeyinka,582556152,Dhahran,adeyinka.statesman@gmail.com

In [14]:
state6 = state.rename({"Last name":"Last_name", "First name":"First_name", "Phone number":"Phone_number"}, axis='columns')
del state6['Unnamed: 0']
state6

,Last_name,First_name,Phone_number,Location,Email
0,Statesman,Oyehan Adeyinka,582556152,Dhahran,adeyinka.statesman@gmail.com

In [15]:
theo = pd.DataFrame(theo)
theo

,Unnamed: 0,Last name,First name,Phone number,Location,E-mail
0,0,ige,theophilus,8052085331,Lagos,igetheophilus02@gmail.com

In [16]:
theo7 = theo.rename({"Last name":"Last_name", "First name":"First_name", "Phone number":"Phone_number", "E-mail":"Email"}, axis='columns')
del theo7['Unnamed: 0']
theo7

  Last_name  First_name  Phone_number Location                      Email
0       ige  theophilus    8052085331    Lagos  igetheophilus02@gmail.com

In [17]:
Con = pd.concat([abdul1, aishat2, bisola3, feranmi4, samuel5, state6, theo7], sort=False)
Con

,Email,First_name,Last_name,Location,Phone_number
0,salawuabdulbaki@gmail.com,abdulbaki,salawu,olawale yahaya bagaruwa street ilorin,9068924442
0,aishatmorenike1@gmail.com,Aishat,Aremu,33 Issah Williams Street Apongnon,7084283672
0,bisolabolomope@gmail.com,Faoziyyah,Bolomope,Oyo,9059329620
0,aechealgr8@gmail.com,Michael,Ajirireloja,Abuja,9076588590
0,samueloreoluwa4@gmail.com,Samuel,AKINLABI,Lagos,7012659092
0,adeyinka.statesman@gmail.com,Oyehan Adeyinka,Statesman,Dhahran,582556152
0,igetheophilus02@gmail.com,theophilus,ige,Lagos,8052085331

In [18]:
mport numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline